{
    "socrates": {
        "name": "Сократ",
        "born": "б. з. д. 469, Афина, Греция",
        "died": "б. з. д. 399, Афина, Греция",
        "philosophy": "Этика, гносеология, софистика",
        "philosophy_definition": "Сократ адамгершілік, білім және адам болмысы мәселелеріне назар аударды. Ол ізгілік біліммен тығыз байланысты, ал надандық жамандыққа әкеледі деп сендірді. Оның философиялау әдісі сұхбаттасушыны шындықты іздеуге ынталандыратын сұрақтар қойылған диалог болды. Сократ шындықты объективті деп санады, бірақ оның танымы өзін-өзі көрсетуді қажет етеді. Ол сондай — ақ сократтық ирония тұжырымдамасына ие болды-бұл әдіс, ол сұхбаттасушыны өз сенімдерін тереңірек түсінуге ынталандыру үшін жауап білмейтіндей кейіп танытты.",
        "notable_works": [
            "Өз еңбектері жоқ, идеялар Платон мен Ксенофонт арқылы беріледі"
        ],
        "influences": [
            "Анаксагор",
            "Парменид"
        ],
        "influenced": [
            "Платон",
            "Аристотель",
            "Батыс философиясы"
        ],
        "key_ideas": {
            "Сократтық әдіс": "Әңгімелесушінің дәлеліндегі қайшылықтарды анықтау және сыни ойлауды ынталандыру үшін сұрақтар қою әдісі.",
            "Білім сияқты ізгілік": "Сократ шынайы білім дұрыс мінез-құлыққа әкеледі, ал надандық зұлымдықтың көзі деп есептеді.",
            "Сократтың ирониясы": "Философ адамдарды өз қателіктерінің тереңдігін түсінуге және шындыққа өз бетінше келуге шақыру үшін жалған надандықты қолданды."
        }
    },
    "plato": {
        "name": "Платон",
        "born": "б.з.д. 427, Афины, Греция",
        "died": "б.з.д. 347, Афины, Греция",
        "philosophy": "Метафизика, эпистемология, саяси философия",
        "philosophy_definition": "Платон идеалды Идеялар әлемінің тұжырымдамасын жасады, оны физикалық объектілер әлемінен гөрі шынайы деп санады. Ол материалдық әлем формалардың идеалды әлемінің көрінісі ғана деп тұжырымдады. Ол өзінің саяси философиясында философтар басқаратын идеалды мемлекет тұжырымдамасын ұсынды. Ол сондай-ақ білімнің табиғаты туралы идеяларды дамытып, таным тек сезімдік қабылдау арқылы емес, мәңгілік шындықтар туралы ойлау арқылы мүмкін болады деп тұжырымдады.",
        "notable_works": [
            "Мемлекет",
            "Федон",
            "Симпозиум"
        ],
        "influences": [
            "Сократ",
            "Парменид",
            "Гераклит"
        ],
        "influenced": [
            "Аристотель",
            "Неоплатонизм",
            "Христиан теологиясы"
        ],
        "key_ideas": {
            "Идеялар теориясы": "материалдық әлемнің барлық объектілері-бұл идеялар әлемінде бар идеалды формалардың жетілмеген көшірмелері.",
            "Философ-Егемен": "Платон мемлекетті данышпандар басқаруы керек деп тұжырымдады, өйткені олар тек шындықты түсініп, әділетті басқара алады.",
            "Трипартит жаны": "жан үш бөліктен тұрады: ақылға қонымды, ашулы (эмоционалды) және әрқайсысы теңдестірілген болуы керек."
        }
    },
    "aristotle": {
        "name": "Аристотель",
        "born": "б.з.д. 384, Стагира, Греция",
        "died": "б.з.д. 322, Эвбея, Греция",
        "philosophy": "Логика, этика, политика, естественные науки",
        "philosophy_definition": "Аристотель батыстық ойлаудың негізіне айналған логика жүйесін жасады. Ол Платонның идеялар теориясын жоққа шығарып, шындық тәжірибе мен бақылаулар арқылы танылады деп сендірді. Этикада ол ізгілік ұғымын экстремалдар арасындағы алтын орта ретінде тұжырымдады. Саясатта ол басқарудың әртүрлі формаларын бөліп, олардың күшті және әлсіз жақтарын талдады. Жаратылыстану ғылымдарында ол табиғат туралы білімді жүйелеу арқылы биология мен физиканың негізін қалады.",
        "notable_works": [
            "Никомах этикасы",
            "Саясат",
            "Метафизика"
        ],
        "influences": [
            "Платон"
        ],
        "influenced": [
            "Александр Македонский",
            "Ортағасырлық схоластика",
            "Қазірғі ғылым"
        ],
        "key_ideas": {
            "Алтын орта": "ізгілік — бұл шектен тыс тепе-теңдікті табу, мысалы, батылдық-қорқақтық пен абайсыз батылдықтың ортасы.",
            "Төрт себеп": "әлемдегі барлық нәрсе төрт себепке байланысты бар: материалдық (неден жасалған), ресми (құрылымы қандай), әрекет ететін (өзгеріске әкелген) және мақсатты (ол үшін бар).",
            "Ізгілік этикасы": "бақытқа ізгіліктерді дамыту және моральдық тұрғыдан мағыналы өмір сүру арқылы қол жеткізіледі."
        }
    },
    "nietzsche": {
        "name": "Фридрих Ницше",
        "born": "15 қазан 1844, Рёккен, Пруссия",
        "died": "25 тамыз 1900, Веймар, Германия",
        "philosophy": "Экзистенциализм, нигилизм",
        "philosophy_definition": "Ницше дәстүрлі құндылықтар өз күшін жоғалтты деп нигилизм философиясын дамытты. Ол өмірдің қозғаушы күші ретінде билікке деген ерік-жігерді және әлеуметтік догмалардан бас тарту арқылы өз құндылықтарын жасайтын Супермен тұжырымдамасын уағыздады. Ницше дін мен адамгершілікті сынға алып, олар адамның даралығы мен әлеуетін басады деп мәлімдеді.",
        "notable_works": [
            "Заратустра осылай деді",
            "Жақсылық пен жамандықтың арғы жағында"
        ],
        "influences": [
            "Шопенгауэр",
            "Кант",
            "Дарвин"
        ],
        "influenced": [
            "Экзистенциалистер",
            "Постмодернистер",
            "Психоанализ"
        ],
        "key_ideas": {
            "Билікке деген ерік": "өмірдің негізгі қағидасы, өзін және қоршаған әлемді жеңуге бағытталған қозғаушы күш.",
            "Супермен": "жаңа құндылықтар жасауға және көпшіліктің адамгершілігінен тыс өмір сүруге қабілетті тұлға идеалы.",
            "Құдай өлді": "діни және дәстүрлі құндылықтарды сынау, адамзат Құдайға деген сенімін жоғалтты және жаңа мағыналар жасауы керек."
        }
    },
    "kant": {
        "name": "Иммануил Кант",
        "born": "22 сәуір 1724, Кёнигсберг, Пруссия",
        "died": "12 ақпан 1804, Кёнигсберг, Пруссия",
        "philosophy": "Трансцендентальды идеализм, эпистемология, этика",
        "philosophy_definition": "Кант трансцендентальды идеализмді біздің әлем туралы біліміміз оны қабылдау қабілетімізбен шектелген деп тұжырымдады. Ол шындықты \"өзіндегі нәрсе\" (ноумен) және \"Біз үшін нәрсе\" (құбылыс) деп бөлді. Ол өзінің этикасында категориялық императивті — сезім мен салдарға емес, ақыл мен парызға негізделген әмбебап моральдық заңды ұсынды.",
        "notable_works": [
            "Таза ақылға сын",
            "Практикалық ақылға сын",
            "Сот қабілетіне сын"
        ],
        "influences": [
            "Готфрид Вильгельм Лейбниц",
            "Давид Юм",
            "Жан-Жак Руссо"
        ],
        "influenced": [
            "Гегель",
            "Шопенгауэр",
            "Неміс идеализмі"
        ],
        "key_ideas": {
            "Трансцендентальды идеализм": "біздің танымымыз ақыл-ой құрылымымен шектеледі, ал шындық біздің қабылдауымыздан тыс болуы мүмкін.",
            "Категориялық императив": "сіздің іс-әрекетіңіздің принципі жалпыға бірдей заңға айналуы үшін әрекет етіңіз.",
            "Ноументтер мен құбылыстарға бөліну": "біз тек құбылыстарды (заттар олар біз үшін) қабылдай аламыз, бірақ ноументтер емес (өзіміздегі заттар)."
        }
    },
    "kierkegaard": {
        "name": "Сёрен Кьеркегор",
        "born": "5 мымыр 1813, Копенгаген, Дания",
        "died": "11 қараша 1855, Копенгаген, Дания",
        "philosophy": "Экзистенциализм, христиан философиясы",
        "philosophy_definition": "Кьеркегор экзистенциализмнің негізін қалаушы болып саналады. Ол адамның субъективтілігін, таңдауын және сенімін зерттеді. Ол шынайы өмір тек жеке таңдау және шынайы сенім арқылы мүмкін болады, ал әлеуметтік нормаларды ұстану арқылы емес деп тұжырымдады. Ол сондай-ақ \"қорқыныш пен қорқыныш\" ұғымын діни тәжірибе аясында талдады.",
        "notable_works": [
            "Немесе-немесе",
            "Қорқыныш пен қорқыныш",
            "Өлімге дейін ауру"
        ],
        "influences": [
            "Гегель",
            "Кант",
            "Лютер"
        ],
        "influenced": [
            "Хайдеггер",
            "Сартр",
            "Экзистенциализм"
        ],
        "key_ideas": {
            "Субъективті шындық": "шындық объективті жүйелер арқылы емес, ішкі тәжірибе арқылы жеке танылады.",
            "Сенімнің діни секірісі": "нағыз сенім ақылдан тыс қисынсыз секіруді қажет етеді.",
            "Болмыстың үш кезеңі": "адам өмірдің үш кезеңінен өтеді: эстетикалық (гедонизм), этикалық (мораль) және діни (сенім)."
        }
    },
    "goethe": {
        "name": "Иоганн Вольфганг фон Гёте",
        "born": "28 тамыз 1749, Франкфурт, Священная Римская империя",
        "died": "22 наурыз 1832, Веймар, Германия",
        "philosophy": "Романтизм, гуманизм, натурфилософия",
        "philosophy_definition": "Гете өз көзқарастарында философия, ғылым және өнер элементтерін біріктірді. Ол әлемді тану тек рационалды талдау арқылы ғана емес, сонымен бірге көркемдік қабылдау арқылы да мүмкін деп тұжырымдады. Өзінің табиғи философиясында ол табиғатқа механикалық көзқарасты сынға алып, оның органикалық тұтастығына баса назар аударды.",
        "notable_works": [
            "Фауст",
            "Жас Вертердің азабы"
        ],
        "influences": [
            "Шекспир",
            "Спиноза"
        ],
        "influenced": [
            "Романтизм",
            "Ницше",
            "Шеллинг"
        ],
        "key_ideas": {
            "Фауст рухы": "ішкі қайшылықтарға қарамастан Шексіз білім мен жетілдіруге ұмтылу.",
            "Органикалық табиғат": "әлем механикалық түрде түсіндірілмейтін ішкі заңдарға сәйкес дамиды.",
            "Ақыл мен сезімнің үйлесімділігі": "шынайы білім тек ақыл мен эмоцияның синтезі арқылы мүмкін болады."
        }
    },
    "schopenhauer": {
        "name": "Артур Шопенгауэр",
        "born": "22 ақпан 1788, Данциг, Пруссия",
        "died": "21 қыркүйек 1860, Франкфурт, Германия",
        "philosophy": "Пессимизм, еріктілік",
        "philosophy_definition": "Шопенгауэр әлемнің негізгі қозғаушы күші ерік — қисынсыз және бейсаналық күш деп есептеді. Ол өмірді азаптың қайнар көзі ретінде көрді және аскетизм, өнер және философия арқылы азаттық жолын ұсынды. Оның көзқарастары кейінгі ойшылдарға, соның ішінде Ницше мен Фрейдке әсер етті.",
        "notable_works": [
            "Әлем ерік пен өкілдік ретінде"
        ],
        "influences": [
            "Кант",
            "Буддизм",
            "Платон"
        ],
        "influenced": [
            "Ницше",
            "Фрейд",
            "Экзистенциализм"
        ],
        "key_ideas": {
            "Ерік Әлемнің мәні ретінде": "бар нәрсенің бәрі өмірге деген соқыр және қисынсыз ерік-жігерге бағынады.",
            "Азап тіршіліктің негізі ретінде": "өмір азапқа толы, өйткені тілектер ешқашан толық қанағаттандырыла алмайды.",
            "Өнер жұбаныш ретінде": "өнер азаптан уақытша арылуға және әлемді өз еркінен тыс көруге мүмкіндік береді."
        }
    },
    "marx": {
        "name": "Карл Маркс",
        "born": "5 мамыр 1818, Трир, Пруссия",
        "died": "14 наурыз 1883, Лондон, Великобритания",
        "philosophy": "Материализм, капитализмге сын, коммунизм",
        "philosophy_definition": "Маркс экономикалық жағдайлар қоғамның дамуын анықтайды деп, Диалектикалық материализмді дамытты. Ол капитализмді жұмысшы табының қанауына негізделген жүйе ретінде сынға алып, коммунистік қоғамды балама ретінде ұсынды.",
        "notable_works": [
            "Капитал",
            "Коммунистік партияның манифесі"
        ],
        "influences": [
            "Гегель",
            "Фейербах",
            "Рикардо"
        ],
        "influenced": [
            "Ленин",
            "Франкфурт мектебі",
            "Қазіргі социализм"
        ],
        "key_ideas": {
            "Тарихи материализм": "қоғамның дамуы өндірістің материалдық жағдайымен анықталады.",
            "Таптық күрес": "езушілер мен езілгендер арасындағы қақтығыс тарихтың қозғаушы күші болып табылады.",
            "Еңбекті иеліктен шығару": "капитализм кезінде жұмысшы өз жұмысының нәтижелерінен алшақтайды."
        }
    }
}