{
    "socrates": {
        "name": "Сократ",
        "born": "469 до н.э., Афины, Греция",
        "died": "399 до н.э., Афины, Греция",
        "philosophy": "Этика, эпистемология, софистика",
        "philosophy_definition": "Сократ сосредоточился на вопросах морали, знания и человеческого существования. Он утверждал, что добродетель тесно связана со знанием, а невежество ведет к пороку. Его метод философствования заключался в диалоге, в котором задавались вопросы, стимулирующие собеседника к поиску истины. Сократ верил, что истина объективна, но её познание требует саморефлексии. Ему также приписывают концепцию сократической иронии — метод, когда он делал вид, что не знает ответа, чтобы стимулировать собеседника к более глубокому осмыслению своих убеждений.",
        "notable_works": [
            "Нет собственных трудов, идеи переданы через Платона и Ксенофонта"
        ],
        "influences": [
            "Анаксагор",
            "Парменид"
        ],
        "influenced": [
            "Платон",
            "Аристотель",
            "Западная философия"
        ],
        "key_ideas": {
            "Сократический метод": "Метод задавания вопросов для выявления противоречий в аргументации собеседника и стимулирования критического мышления.",
            "Добродетель как знание": "Сократ считал, что истинное знание ведет к правильному поведению, а невежество является источником зла.",
            "Ирония Сократа": "Философ использовал притворное неведение, чтобы побудить людей осознать глубину своих ошибок и прийти к истине самостоятельно."
        }
    },
    "plato": {
        "name": "Платон",
        "born": "427 до н.э., Афины, Греция",
        "died": "347 до н.э., Афины, Греция",
        "philosophy": "Метафизика, эпистемология, политическая философия",
        "philosophy_definition": "Платон разработал концепцию идеального мира идей, который он считал более реальным, чем мир физических объектов. Он утверждал, что материальный мир является лишь отражением идеального мира форм. В своей политической философии он представил концепцию идеального государства, где правят философы. Он также развил идеи о природе знания, утверждая, что познание возможно только через размышления о вечных истинах, а не через чувственное восприятие.",
        "notable_works": [
            "Государство",
            "Федон",
            "Симпозиум"
        ],
        "influences": [
            "Сократ",
            "Парменид",
            "Гераклит"
        ],
        "influenced": [
            "Аристотель",
            "Неоплатонизм",
            "Христианская теология"
        ],
        "key_ideas": {
            "Теория идей": "Все объекты материального мира являются лишь несовершенными копиями идеальных форм, существующих в мире идей.",
            "Философ-государь": "Платон утверждал, что государством должны управлять мудрецы, так как только они способны постигать истину и управлять справедливо.",
            "Трипартитная душа": "Душа состоит из трех частей: разумной, яростной (эмоциональной) и желающей, каждая из которых должна быть сбалансирована."
        }
    },
    "aristotle": {
        "name": "Аристотель",
        "born": "384 до н.э., Стагира, Греция",
        "died": "322 до н.э., Эвбея, Греция",
        "philosophy": "Логика, этика, политика, естественные науки",
        "philosophy_definition": "Аристотель разработал систему логики, которая стала основой западного мышления. Он отверг теорию идей Платона, утверждая, что реальность познаваема через опыт и наблюдения. В этике он сформулировал концепцию добродетели как золотой середины между крайностями. В политике он выделил различные формы правления и проанализировал их сильные и слабые стороны. В естественных науках он заложил основы биологии и физики, систематизируя знания о природе.",
        "notable_works": [
            "Никомахова этика",
            "Политика",
            "Метафизика"
        ],
        "influences": [
            "Платон"
        ],
        "influenced": [
            "Александр Македонский",
            "Средневековая схоластика",
            "Современная наука"
        ],
        "key_ideas": {
            "Золотая середина": "Добродетель заключается в нахождении баланса между крайностями, например, мужество — это середина между трусостью и безрассудной смелостью.",
            "Четыре причины": "Всё в мире существует по четырём причинам: материальной (из чего сделано), формальной (какова структура), действующей (что привело к изменению) и целевой (для чего существует).",
            "Этика добродетели": "Счастье достигается путем развития добродетелей и ведения морально осмысленной жизни."
        }
    },
    "nietzsche": {
        "name": "Фридрих Ницше",
        "born": "15 октября 1844, Рёккен, Пруссия",
        "died": "25 августа 1900, Веймар, Германия",
        "philosophy": "Экзистенциализм, нигилизм",
        "philosophy_definition": "Ницше развил философию нигилизма, утверждая, что традиционные ценности утратили свою силу. Он проповедовал волю к власти как движущую силу жизни и концепцию сверхчеловека, который создаёт собственные ценности, отвергая общественные догмы. Ницше критиковал религию и мораль, утверждая, что они подавляют человеческую индивидуальность и потенциал.",
        "notable_works": [
            "Так говорил Заратустра",
            "По ту сторону добра и зла"
        ],
        "influences": [
            "Шопенгауэр",
            "Кант",
            "Дарвин"
        ],
        "influenced": [
            "Экзистенциалисты",
            "Постмодернисты",
            "Психоанализ"
        ],
        "key_ideas": {
            "Воля к власти": "Фундаментальный принцип жизни, движущая сила, направленная на преодоление себя и окружающего мира.",
            "Сверхчеловек": "Идеал личности, который способен создавать новые ценности и жить вне морали толпы.",
            "Бог умер": "Критика религиозных и традиционных ценностей, утверждающая, что человечество утратило веру в Бога и должно создать новые смыслы."
        }
    },
    "kant": {
        "name": "Иммануил Кант",
        "born": "22 апреля 1724, Кёнигсберг, Пруссия",
        "died": "12 февраля 1804, Кёнигсберг, Пруссия",
        "philosophy": "Трансцендентальный идеализм, эпистемология, этика",
        "philosophy_definition": "Кант разработал трансцендентальный идеализм, утверждая, что наше познание мира ограничено нашей способностью воспринимать его. Он разделял реальность на 'вещь в себе' (ноумен) и 'вещь для нас' (феномен). В своей этике он предложил категорический императив — универсальный моральный закон, основанный на разуме и долге, а не на чувствах или последствиях.",
        "notable_works": [
            "Критика чистого разума",
            "Критика практического разума",
            "Критика способности суждения"
        ],
        "influences": [
            "Готфрид Вильгельм Лейбниц",
            "Давид Юм",
            "Жан-Жак Руссо"
        ],
        "influenced": [
            "Гегель",
            "Шопенгауэр",
            "Немецкий идеализм"
        ],
        "key_ideas": {
            "Трансцендентальный идеализм": "Наше познание ограничено структурой разума, а реальность может существовать за пределами нашего восприятия.",
            "Категорический императив": "Действуй так, чтобы принцип твоего поступка мог стать всеобщим законом.",
            "Разделение на ноумены и феномены": "Мы можем воспринимать только феномены (вещи как они являются для нас), но не ноумены (вещи в себе)."
        }
    },
    "kierkegaard": {
        "name": "Сёрен Кьеркегор",
        "born": "5 мая 1813, Копенгаген, Дания",
        "died": "11 ноября 1855, Копенгаген, Дания",
        "philosophy": "Экзистенциализм, христианская философия",
        "philosophy_definition": "Кьеркегор считается основоположником экзистенциализма. Он исследовал человеческую субъективность, выбор и веру. Он утверждал, что истинное существование возможно только через индивидуальный выбор и подлинную веру, а не через следование общественным нормам. Он также анализировал понятие 'страха и трепета' в контексте религиозного опыта.",
        "notable_works": [
            "Или-или",
            "Страх и трепет",
            "Болезнь к смерти"
        ],
        "influences": [
            "Гегель",
            "Кант",
            "Лютер"
        ],
        "influenced": [
            "Хайдеггер",
            "Сартр",
            "Экзистенциализм"
        ],
        "key_ideas": {
            "Субъективная истина": "Истина познаётся индивидуально через внутренний опыт, а не через объективные системы.",
            "Религиозный прыжок веры": "Настоящая вера требует иррационального прыжка за пределы разума.",
            "Три стадии существования": "Человек проходит через три стадии жизни: эстетическую (гедонизм), этическую (мораль) и религиозную (вера)."
        }
    },
    "goethe": {
        "name": "Иоганн Вольфганг фон Гёте",
        "born": "28 августа 1749, Франкфурт, Священная Римская империя",
        "died": "22 марта 1832, Веймар, Германия",
        "philosophy": "Романтизм, гуманизм, натурфилософия",
        "philosophy_definition": "Гёте сочетал в своих взглядах элементы философии, науки и искусства. Он утверждал, что познание мира возможно не только через рациональный анализ, но и через художественное восприятие. В своей натурфилософии он критиковал механистический подход к природе и подчеркивал её органическую целостность.",
        "notable_works": [
            "Фауст",
            "Страдания юного Вертера"
        ],
        "influences": [
            "Шекспир",
            "Спиноза"
        ],
        "influenced": [
            "Романтизм",
            "Ницше",
            "Шеллинг"
        ],
        "key_ideas": {
            "Фаустовский дух": "Стремление к бесконечному познанию и совершенствованию, несмотря на внутренние противоречия.",
            "Органическая природа": "Мир развивается по внутренним законам, которые нельзя объяснить механистически.",
            "Гармония разума и чувств": "Истинное познание возможно только через синтез разума и эмоций."
        }
    },
    "schopenhauer": {
        "name": "Артур Шопенгауэр",
        "born": "22 февраля 1788, Данциг, Пруссия",
        "died": "21 сентября 1860, Франкфурт, Германия",
        "philosophy": "Пессимизм, волюнтаризм",
        "philosophy_definition": "Шопенгауэр считал, что основной движущей силой мира является воля — иррациональная и бессознательная сила. Он видел жизнь как источник страданий и предлагал путь освобождения через аскетизм, искусство и философию. Его взгляды оказали влияние на последующих мыслителей, включая Ницше и Фрейда.",
        "notable_works": [
            "Мир как воля и представление"
        ],
        "influences": [
            "Кант",
            "Буддизм",
            "Платон"
        ],
        "influenced": [
            "Ницше",
            "Фрейд",
            "Экзистенциализм"
        ],
        "key_ideas": {
            "Воля как сущность мира": "Всё существующее подчинено слепой и иррациональной воле к жизни.",
            "Страдание как основа существования": "Жизнь полна страданий, поскольку желания никогда не могут быть полностью удовлетворены.",
            "Искусство как утешение": "Искусство позволяет временно освободиться от страданий и увидеть мир вне воли."
        }
    },
    "marx": {
        "name": "Карл Маркс",
        "born": "5 мая 1818, Трир, Пруссия",
        "died": "14 марта 1883, Лондон, Великобритания",
        "philosophy": "Материализм, критика капитализма, коммунизм",
        "philosophy_definition": "Маркс разработал диалектический материализм, утверждая, что экономические условия определяют развитие общества. Он критиковал капитализм как систему, основанную на эксплуатации рабочего класса, и предложил коммунистическое общество как альтернативу.",
        "notable_works": [
            "Капитал",
            "Манифест коммунистической партии"
        ],
        "influences": [
            "Гегель",
            "Фейербах",
            "Рикардо"
        ],
        "influenced": [
            "Ленин",
            "Франкфуртская школа",
            "Современный социализм"
        ],
        "key_ideas": {
            "Исторический материализм": "Развитие общества определяется материальными условиями производства.",
            "Классовая борьба": "Конфликт между угнетателями и угнетёнными — движущая сила истории.",
            "Отчуждение труда": "При капитализме рабочий отчуждён от результатов своего труда."
        }
    }
}